### 7.23.子网划分和路由寻址

#### 路由寻址(比交换机多网络层的路由寻址)

![image-20240723181003561](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240723181003561.png)

P1配置

![image-20240723182041648](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240723182041648.png)

R1配置

![image-20240723181838051](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240723181838051.png)

![image-20240723181934571](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240723181934571.png)

#### 作业内容

作业名称

利用GNS3进行子网划分

##### 作业一

192.168.1.0/24网段，划分成4个大小相同的子网，互相能够ping通

###### 子网划分

~~~
网络地址：11000000 10101000 00000001 00000000
子网掩码：11111111 11111111 11111111 00000000

划分子网，需要划分成2个 那就是使用1个主机号  2^1
那么划分4个大小相同的子网，要2个主机号   2^2
（子网掩码24+2=26）
网络地址：11000000 10101000 00000001 00|000000
192.168.1.0/24                     00
ip地址范围：192.168.1.1-192.168.1.63
192.168.1.64/24                    01
ip地址范围：192.168.1.65-192.168.1.127
192.168.1.128/24                   10
ip地址范围：192.168.1.129-192.168.1.191
192.168.1.192/24                   11
ip地址范围：192.168.1.193-192.168.1.255
~~~

###### 网络拓扑图

R1路由器，四个接口代表四个子网

![image-20240723210935668](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240723210935668.png)

如图配置四个PC的IP地址和对应接口地址，子网掩码应该为子网划分后的子网掩码！

###### 配置R1路由器的四个接口网关

![image-20240724085101809](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240724085101809.png)

![image-20240724085234163](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240724085234163.png)

###### 配置PC1的IP和gateway

![image-20240724084311582](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240724084311582.png)

###### 配置PC4的IP和gateway

![image-20240724084351012](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240724084351012.png)

###### 配置PC3的IP和gateway

![image-20240724084854495](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240724084854495.png)

###### 配置PC2的IP和gateway

![image-20240724084946744](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240724084946744.png)

###### 测试是否可以互相ping通

![image-20240724085336117](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240724085336117.png)

##### 作业二

172.26.26.0/26网段，划分为2个相同子网，互相能够ping通

每个子网放1-2台PC

###### 子网划分

~~~
网络地址：10101100 00011010 00011010 00000000
子网掩码：11111111 11111111 11111111 11000000
划分2个子网，要1个主机号（子网掩码26+1=27）
网络地址：10101100 00011010 00011010 000|00000
172.26.26.0/26                       0
IP地址范围：172.26.26.1-172.26.26.31
172.26.26.32/26                      1
IP地址范围：172.26.26.33-172.26.26.63
~~~

###### 网络拓扑图

![image-20240724090846093](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240724090846093.png)

###### 配置R1的f0/0接口和f0/1接口

![image-20240724091141838](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240724091141838.png)

###### 配置PC1

![image-20240724091231291](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240724091231291.png)

###### 配置PC2

![image-20240724091320644](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240724091320644.png)

###### 测试是否互通

![image-20240724091429641](C:/Users/86184/AppData/Roaming/Typora/typora-user-images/image-20240724091429641.png)

### 7.25.数据报分析和静态路由

#### ARP协议

ARP协议介绍：

```
将IP地址解析成MAC地址（物理地址）
```

##### 作业：

网络层协议数据包分析

###### 作业内容：

在GNS3环境搭建简单的网络，利用wireshark工具抓取和分析arp.ip、icmp协议数据包结构

###### 拓扑图

![image-20240725104401728](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725104401728.png)

###### 发送请求

![image-20240725104346878](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725104346878.png)

###### 抓包

###### ARP报文分析

![image-20240725104611612](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725104611612.png)

![image-20240725105810124](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725105810124.png)

```
Address Resolution Protocol (request)
Hardware type: Ethernet (1)
//硬件类型字段指定了用于传输的硬件接口类型。这里的值"1"代表以太网。
Protocol type: IPv4 (Ox0800)
//协议类型字段指定了要映射的协议地址类型。这里的值"0x0800"是IPv4的十六进制表示。
Hardware size: 6 
//硬件大小字段指定了硬件地址（如MAC地址）的长度，单位是字节。对于以太网，这个值通常是6，因为MAC地址是6字节长。
Protocol size: 4 
//协议大小字段指定了协议地址（如IPv4地址）的长度，单位是字节。对于IPv4，这个值是4，因为IPv4地址是4字节长。
opcode: request (1)    
//操作码字段定义了ARP消息的类型。这里的值"1"代表这是一个ARP请求。ARP操作码"1"表示请求，而操作码"2"表示ARP响应。
Sender MAC address: 00:50: 79:66:68:0o (00: 50:79:66:68:00)Sender IPaddress: 172.26.26.3
Target MAC address: Broadcast (ff:ff:ff:ff:ff:ff)//广播
Target IP address: 172.26.26.1  //目标地址
```

#### ICMP协议

###### 报文分析![image-20240725110545949](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725110545949.png)

![image-20240725110731181](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725110731181.png)

```
Internet Control Message Protocol
Type: 8 (Echo (ping) request) 
//类型字段表明这是一个ICMP Echo请求，通常用于ping操作，以检查网络连接是否可达。
code: o 
//对于类型8（Echo请求），代码字段通常是0，因为Echo请求不使用代码字段来进一步分类消息。
Checksum: oxd052 [ correct]
//校验和字段用于确保ICMP消息在传输过程中没有被损坏。这里显示的值是0xd052，并且旁边注明了"[correct]"，表示校验和是正确的。
[ Checksum Status: Good] 
//这进一步确认了校验和是有效的，没有检测到错误
Identifier (BE): 20407 (Ox4fb7)
Identifier (LE): 46927 (0xb74f)sequence Number (BE): 2 (ox0002)
sequence Number (LE): 512 (ox6200)
[Response frame: 8] //返回的数据报
Data(56 bytes)
//这部分包含了ICMP消息的数据部分，通常是发送方填充的数据，以供接收方在回复时原样返回。这里显示的数据是56字节长。
Data: 08090a0bocod0eOf101112131415161[Length: 56]
```

###### 常见的ICMP消息类型：

- **类型 0 - Echo Reply**：响应Echo请求（ping请求）的消息。
- **类型 3 - Destination Unreachable**：当数据包无法到达目的地时发送的消息。
- **类型 8 - Echo Request**：通常用于ping操作，用于测试网络连接。
- **类型 11 - Time Exceeded**：当数据包的TTL（生存时间）字段减到0时发送的消息。

![image-20240725111907833](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725111907833.png)

![image-20240725112458470](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725112458470.png)

###### 交换机的MAC地址表

* 含义：

交换机（Switch）的MAC地址表是一个关键的数据结构，它用于在网络中转发以太网帧。MAC地址表记录了交换机端口与连接到该端口的设备MAC地址之间的映射关系。

实验抓包分析

![image-20240725114808918](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725114808918.png)

第一次ping交换机的MAC地址表没有所需条目，需要广播学习需要的条目

![image-20240725114638840](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725114638840.png)

第二次ping（MAC地址表已经学习到需要的条目，交换机只需要单播转发数据帧）

![image-20240725114836167](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725114836167.png)

##### 交换机和路由器工作模式及命令

GNS3的交换机没有命令行，以下工作模式和命令适用路由器

![image-20240725152203053](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725152203053.png)

![image-20240725152249797](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725152249797.png)

![image-20240725153006855](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725153006855.png)

![](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725153020095.png)

#### 路由器静态路由配置

* 静态路由
  * 由管理员手工配置的，是单向的，缺乏灵活性
  * 数据包如果要到达**非直连网络**需要在路由表中**填加条目**，静态路由需要**手动填加**路由条目

![image-20240725160532144](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725160532144.png)

无法直接连通

![image-20240725160603463](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725160603463.png)

静态路由的手动配置：

R1配置

```
R1#conf t           //进入全局控制
R1(config)#int f0/1  //由路由器的端口f0/0转发
R1(config-if)#ip route 192.168.1.0 255.255.255.0 172.16.0.2   
//192.168.1.0是目标网络的网段
//172.16.0.2 到达目标网络的下一跳路由器的接口地址。
R1(config)#end
R1#write memory  //保存
```

R2配置

```
R2#conf t
R2(config)#int f0/0
R2(config-if)#ip route 192.168.0.0 255.255.255.0 172.16.0.1
R2(config)#end
R2#wr
```

可以互相通信

![image-20240725190844532](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725190844532.png)![image-20240725190857477](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725190857477.png)



![image-20240725161737220](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725161737220.png)

#### VLAN

* 含义

VLAN（Virtual Local Area Network，**虚拟局域网**）是一种将物理局域网（LAN）在逻辑上分割成多个虚拟网络的技术。这种技术允许网络管理员将设备分组到不同的广播域中，即使这些设备物理上连接到同一个交换机或跨多个交换机。

##### VLAN的主要特点和优势：

1. **广播域隔离**：VLAN可以限制广播流量，仅在同一VLAN内的设备之间传播，从而减少网络拥塞。
2. **提高安全性**：通过将用户和设备分组到不同的VLAN，可以限制对敏感数据的访问。
3. **提高网络性能**：由于减少了广播和多播流量，网络的整体性能得到提升。
4. **灵活性**：设备可以被逻辑地分配到任何VLAN，而不受物理位置的限制。
5. **易于管理**：VLAN简化了网络的配置和维护，因为可以根据组织需求轻松调整VLAN结构。

###### 拓扑图

![image-20240725200308311](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725200308311.png)

**PC0**:

IP地址：192.168.1.1

子网掩码：255.255.255.0

**PC1**:

IP地址：192.168.1.2

子网掩码：255.255.255.0

**PC2**:

IP地址：192.168.1.3

子网掩码：255.255.255.0

可互相ping通

![image-20240725201224314](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725201224314.png)

##### 配置VLAN的步骤：

1. **定义VLAN**：在交换机上创建并定义VLAN ID和名称。

   ```
   Switch(config)# vlan 10
   Switch(config-vlan)# name VLAN10
   Switch(config-vlan)# exit
   ```

   

2. **分配端口**：将交换机的端口分配给特定的VLAN，这些端口称为接入端口。

   ````
   Switch(config)#int f0/1   //进入f0/1接口
   Switch(config-if)#switchport access vlan 10  //将f0/1接口分配给VLAN 10
   Switch(config-if)#exit
   Switch(config)#int f0/2
   Switch(config-if)#switchport access vlan 20
   Switch(config-if)#exit
   Switch(config)#int f0/3
   Switch(config-if)#switchport access vlan 30
   Switch(config-if)#end
   ````

   完成这些步骤后，接口f0/1、f0/2和f0/3将分别属于VLAN 10、VLAN 20和VLAN 30。连接到这些接口的设备将**只能与同一VLAN中**的设备通信，除非有额外的路由配置允许它们跨VLAN通信。

   ###### 测试：三台位于不同VLAN的主机无法互相通信

   ![image-20240725200022723](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725200022723.png)

3. **配置VLAN接口**：为每个VLAN配置虚拟接口，并为其分配IP地址。

4. **设置VLAN间路由**：如果需要在不同的VLAN之间路由流量，需要在路由器或三层交换机上配置VLAN间路由。                                       ![image-20240725223407812](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725223407812.png)

以上是在不同交换机的同一网段的两台主机

```
交换机1配置如下
```

```
Switch(config)#int f0/1

//f0/1接口分配到VLAN 10
Switch(config-if)#switchport access vlan 10 
Switch(config-if)#exit
Switch(config)#int f0/2

//f0/2接口开启trunk链路
Switch(config-if)#switchport mode trunk
Switch(config-if)#end
Switch#conf t
Switch(config)#int f0/2
//该trunk只允许VLAN10过
Switch(config-if)#switchport trunk allowed vlan 10
Switch(config-if)#end
Switch#wr
```

```
交换机2的配置同上
```

###### 测试

![image-20240725224227384](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240725224227384.png)

###### 问题：

为什么在不同交换机下的同一个网段内的两台主机不设置trunk和VLAN可以直接互通？

即使没有明确配置VLAN和trunk，只要交换机之间有物理连接，并且交换机的端口被正确地配置为access模式，那么连接在同一交换机上的主机之间可以互相ping通，而连接在不同交换机上的主机之间也可以通过交换机之间的物理连接互相ping通。

但是，如果网络中存在**多个交换机**，并且您希望**控制数据帧的转发和广播行为**，以提高网络的安全性和性能，那么配置VLAN和trunk是很有必要的。通过配置VLAN，您可以将网络逻辑上分割成多个广播域，从而限制广播流量。通过配置trunk，您可以允许不同交换机之间传输多个VLAN的数据帧，并控制哪些VLAN可以通过trunk链路。

### 7.26.ACL访问控制

#### 访问控制列表

![image-20240726090637804](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726090637804.png)

![image-20240726090729322](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726090729322.png)

![image-20240726091535100](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726091535100.png)

![image-20240726091716255](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726091716255.png

##### 访问控制列表原理流程图

![image-20240726093508212](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726093508212.png)

![image-20240726102706258](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726102706258.png)

![image-20240726102849065](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726102849065.png)

![image-20240726102905348](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726102905348.png)

##### 标准ACL配置步骤：

1. **定义ACL：**

   - 进入全局配置模式。

     ```
     Router(config)# access-list ACL编号 permit|deny 源地址 源地址的反向掩码
     ```

   - 例如，创建一个标准ACL，编号为10，允许来自192.168.1.0/24网段的访问：

     ```
     Router(config)# access-list 10 permit 192.168.1.0 0.0.0.255（反向源码）
     ```

2. **应用ACL：**

   - 在接口配置模式下，将ACL应用于接口的入站或出站方向。

     ```
     Router(config)# interface 接口类型 接口号
     Router(config-if)# ip access-group ACL编号 in|out
     ```

   - 例如，将ACL 10应用于接口f0/1的入站方向：

     ```
     Router(config)# int f0
     Router(config-if)# ip access-group 10 in
     ```

##### ACL（访问控制）实验

###### 拓扑图

![image-20240726111727878](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726111727878.png)

**R1**

```
R1#conf t
R1(config)#int f0/0  
R1(config-if)#ip add 202.100.10.1 255.255.255.0   //配置ip
R1(config-if)#no shut
R1(config-if)#exit
R1(config)#ip route 0.0.0.0 0.0.0.0 202.100.10.2 
//配置静态路由，可以访问全网段全ip，下一跳路由接口为202.100.10.2
R1(config)#end
R1#wr
```

**R2**

```
R2#conf t
R2(config)#int f0/0  
R2(config-if)#ip add 202.100.10.2 255.255.255.0   //配置f0/0的ip
R2(config-if)#no shut
R2(config-if)#exit
R2(config)#int f0/1  
R2(config-if)#ip add 202.100.20.1 255.255.255.0   //配置f0/1的ip
R2(config-if)#no shut
R2(config)#end
```

**R3**

```
R3#conf t
R3(config)#int f0/0  
R3(config-if)#ip add 202.100.20.2 255.255.255.0   //配置ip
R3(config-if)#no shut
R3(config-if)#exit
R3(config)#ip route 0.0.0.0 0.0.0.0 202.100.20.1 
//配置静态路由，可以访问全网段全ip，下一跳路由接口为202.100.20.1
```

**R3设置ACL访问控制策略**

```
R3(config)#access-list 1 deny 202.100.10.1 0.0.0.0 
//创建ACL，编号为1，禁止来自202.100.10.1的全网段访问
R3(config)#int f0/0   //进入接口
R3(config-if)#ip access-group 1 in  //将ACL 1 应用于接口f0/0的入站方向
R3(config-if)#exit
R3(config)#exit
R3#wr
```

设置ACL前，R1和R3可以互相ping通

![image-20240726111828974](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726111828974.png)

设置后R1无法ping通R3

![image-20240726112030699](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726112030699.png)

#### 实验二

##### 拓扑图

![image-20240726162635608](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726162635608.png)

##### 实验要求：

1、全部使用标准ACL控制

2、10网段禁止访问50网段，其他不受限制        

3、PC2 40.2禁止访问50网段

4、PCO 10.2禁止访问40网段

##### **注意要点**和步骤

###### 1. 为所有pc配置IP和网关地址。

###### 2. 为路由器R0 配置IP。

以添加R0 g0/0接口为例：

```
R0(config)#int g0/0

R0(config-if)#ip add 192.168.10.254 255.255.255.0

R0(config-if)#no shut
```

依次为R0 g0/1 g0/2接口添加IP地址。

 

###### 3. 为路由器R1配置IP，配置步骤和命令参考R0的。

 

###### 4. 为路由器R0配置静态路由。

 ```
R0(config)#ip route 192.168.40.0 255.255.255.0 192.168.20.3
 ```

###### 5. 为路由器R1配置静态路由

```
R1(config)#ip route 192.168.50.0 255.255.255.0 192.168.20.2

R1(config)#ip route 192.168.10.0 255.255.255.0 192.168.20.2
```

###### 6. 验证网络通信

分别选择10 40 50网段选择一台电脑，ping其他网段电脑，测试网络互通。

```
C:\>ping 192.168.40.2

 

Pinging 192.168.40.2 with 32 bytes of data:

 

Request timed out.

Request timed out.

Reply from 192.168.40.2: bytes=32 time<1ms TTL=126

Reply from 192.168.40.2: bytes=32 time=2ms TTL=126
```

###### 7.添加ACL规则

10网段禁止访问50网段,其他不受限制

PC2 40.2禁止访问50网段

 ```
R0(config)#access-list 1 deny 192.168.10.0 0.0.0.255

R0(config)#access-list 1 deny 192.168.40.2 0.0.0.0

R0(config)#access-list 1 permit any

R0(config)#int g0/2

R0(config-if)#ip access-group 1 out
 ```

在R0或R1上配置，此处以配置R1为例

```
R1(config)#access-list 2 deny 192.168.10.2 0.0.0.0

R1(config)#access-list 2 permit any

R1(config)#int g0/0

R1(config-if)#ip access-group 2 in
```

###### 自己做的实验如下

* PC的ip和网关

  如拓扑图所示配置

* 路由器的接口的ip

  如图

* 不同路由器不同网段的主机想要互通，需要手动配置静态路由

  ```
  R2(config)#ip route 192.168.10.0 255.255.255.0 192.168.20.2
  R2(config)#ip route 192.168.40.0 255.255.255.0 192.168.30.3
  ```

  ```
  R1(config)#ip route 192.168.50.0 255.255.255.0 192.168.20.3
  ```

  ```
  R3(config)#ip route 192.168.50.0 255.255.255.0 192.168.30.2
  ```

  ###### 添加标准ACL访问控制

  * 10网段禁止访问50网段，其他不受限制

    ```
    R2(config)#access-list 1 deny 192.168.10.0 0.0.0.0
    R2(config)#access-list 2 permit any   //其他不受限
    R2(config)#int f0/0      //注意是从f0/0入站，从f0/1出站
    R2(config-if)#ip access-group 1 in
    ```

    ![image-20240726171025430](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726171025430.png)

  * PC2 40.2禁止访问50网段

    ```
    R2(config)#access-list 3 deny 19.168.40.2 0.0.0.0  
    R2(config)#int f1/0    //从f0/1入站
    R2(config-if)#ip access-group 3 in  
    ```

    ![image-20240726171557429](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240726171557429.png)

    

  * PCO 10.2禁止访问40网段

```
R3(config)#access-list 4 deny 192.168.10.0 0.0.0.0
R3(config)#int f0/0
R3(config-if)#ip access-group 4 in
```

### 7.27.NAT网络地址转换

![image-20240727091223792](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240727091223792.png)

![image-20240727093519376](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240727093519376.png)

![image-20240727093837101](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240727093837101.png)

![](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240727101837444.png)

![image-20240727101858333](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240727101858333.png)



#### 静态NAT地址转换实验

##### 拓扑图

![image-20240727123922387](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240727123922387.png)

为R0 R1路由器添加HWIC-2T模块（提供两个串行接口）

![image-20240727113211714](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240727113211714.png)

##### 步骤如下：

###### 1.为所有PC和服务器配置IP和网关地址

###### 2.为路由器R0 R1配置IP

以添加R0 f0/0接口为例：

```
Router>enable
Router#configure terminal
Router(config)#interface FastEthernet0/0
Router(config-if)#ip address 192.168.23.1 255.255.255.0
Router(config-if)#no shut
```

为R0 s0/1/0接口，R1 s0/1/0 f0/0接口添加IP地址。

测试网络通信

![image-20240727121736732](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240727121736732.png)

内网可通，外网不可通

###### 3.为路由器R0 R1配置静态路由

```
Router#conf t
Router(config)#ip route 0.0.0.0  0.0.0.0 110.110.1.2
Router(config)#exit
```



###### 4.为路由器R0添加静态地址转换

```
Router#conf t
Router(config)#ip nat inside source static 192.168.23.2 110.110.1.1
//这条命令配置了一个静态NAT映射。它将内部网络中的私有IP地址 192.168.23.2 映射到外部网络中的公有IP地址 110.110.1.1。这意味着所有来自 192.168.23.2 的流量都将被转换成来自 110.110.1.1。

Router(config)#int s0/1/0
Router(config-if)#ip nat outside  
//这条命令将串行接口 s0/1/0 标记为NAT的外部接口。这意味着所有通过这个接口的流量都将被视为来自或去往外部网络。

Router(config-if)#exit
Router(config)#int f0/0
Router(config-if)#ip nat inside  
//这条命令将快速以太网接口 f0/0 标记为NAT的内部接口。这意味着所有通过这个接口的流量都将被视为来自或去往内部网络。

Router(config-if)#end
Router#wr
```

###### 5.验证内网可ping通外网

![image-20240728001334586](C:\Users\86184\AppData\Roaming\Typora\typora-user-images\image-20240728001334586.png)

问题：

如果ping不通，可能是R1未配置静态路由，或者PC的IP配置掉了，或者是系统未保存先前的配置，需要重新排查设置。



